## Deploy bootstrap log
```
❯ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.locks will be created
  + resource "aws_dynamodb_table" "locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "tfstate-locks"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_s3_bucket.tfstate will be created
  + resource "aws_s3_bucket" "tfstate" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "contoso-tf-state-1ed3a58b-c137-4a46-b4a2-6e9265c0e719"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_public_access_block.pab will be created
  + resource "aws_s3_bucket_public_access_block" "pab" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.sse will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "sse" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.v will be created
  + resource "aws_s3_bucket_versioning" "v" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket = "contoso-tf-state-1ed3a58b-c137-4a46-b4a2-6e9265c0e719"
  + table  = "tfstate-locks"

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_dynamodb_table.locks: Creating...
aws_s3_bucket.tfstate: Creating...
aws_s3_bucket.tfstate: Creation complete after 2s [id=contoso-tf-state-1ed3a58b-c137-4a46-b4a2-6e9265c0e719]
aws_s3_bucket_public_access_block.pab: Creating...
aws_s3_bucket_versioning.v: Creating...
aws_s3_bucket_server_side_encryption_configuration.sse: Creating...
aws_s3_bucket_public_access_block.pab: Creation complete after 0s [id=contoso-tf-state-1ed3a58b-c137-4a46-b4a2-6e9265c0e719]
aws_s3_bucket_server_side_encryption_configuration.sse: Creation complete after 1s [id=contoso-tf-state-1ed3a58b-c137-4a46-b4a2-6e9265c0e719]
aws_s3_bucket_versioning.v: Creation complete after 1s [id=contoso-tf-state-1ed3a58b-c137-4a46-b4a2-6e9265c0e719]
aws_dynamodb_table.locks: Creation complete after 7s [id=tfstate-locks]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

Outputs:

bucket = "contoso-tf-state-1ed3a58b-c137-4a46-b4a2-6e9265c0e719"
table = "tfstate-locks"
```